In [4]:
import pandas as pd

In [5]:
df = pd.read_csv('https://raw.githubusercontent.com/paisely65/IS362-Week-5-Assignment/master/MovieRatings.csv', 
                 index_col='Raters')

In [3]:
df

,Beauty and the Beast,Pirates of the Caribbean- Dean men tell no tales,La La Land,Hidden Figures,Fences,Manchester by the Sea
Raters,,,,,,
Carly,5,NaN,1,4,2,1
Mike,1,3,5,5,4,4
Sam,NaN,4,4,NaN,1,3
Christina,4,5,3,3,5,5
Nigel,4,5,4,5,5,4
Maddie,5,NaN,5,5,4,1

In [6]:
#Renaming a column to fisx an error.
df.rename(columns={'Pirates of the Caribbean- Dean men tell no tales':'Pirates of the Caribbean - Dead men tell no tales'}, inplace=True)

In [7]:
df

,Beauty and the Beast,Pirates of the Caribbean - Dead men tell no tales,La La Land,Hidden Figures,Fences,Manchester by the Sea
Raters,,,,,,
Carly,5.0,NaN,1,4.0,2,1
Mike,1.0,3.0,5,5.0,4,4
Sam,NaN,4.0,4,NaN,1,3
Christina,4.0,5.0,3,3.0,5,5
Nigel,4.0,5.0,4,5.0,5,4
Maddie,5.0,NaN,5,5.0,4,1

In [4]:
# Average ratings for each user

df.T.mean().sort_values()

Raters
Carly        2.600000
Sam          3.000000
Mike         3.666667
Maddie       4.000000
Christina    4.166667
Nigel        4.500000
dtype: float64

In [5]:
# Average ratings for each movie

df.mean().sort_values()

Manchester by the Sea                               3.000000
Fences                                              3.500000
La La Land                                          3.666667
Beauty and the Beast                                3.800000
Pirates of the Caribbean- Dean men tell no tales    4.250000
Hidden Figures                                      4.400000
dtype: float64

In [6]:
# Normalize data using formula from here: http://bi-analytics.org/topic/9-standardization-vs-normalization/
df_norm = (df - df.min()) / (df.max() - df.min())

df_norm

,Beauty and the Beast,Pirates of the Caribbean- Dean men tell no tales,La La Land,Hidden Figures,Fences,Manchester by the Sea
Raters,,,,,,
Carly,1.00,NaN,0.00,0.5,0.25,0.00
Mike,0.00,0.0,1.00,1.0,0.75,0.75
Sam,NaN,0.5,0.75,NaN,0.00,0.50
Christina,0.75,1.0,0.50,0.0,1.00,1.00
Nigel,0.75,1.0,0.75,1.0,1.00,0.75
Maddie,1.00,NaN,1.00,1.0,0.75,0.00

In [7]:
# Average ratings for each user (using normalized data)

df_norm.T.mean().sort_values()

Raters
Carly        0.350000
Sam          0.437500
Mike         0.583333
Christina    0.708333
Maddie       0.750000
Nigel        0.875000
dtype: float64

In [8]:
# Average ratings for movie (using normalized data)

df_norm.mean().sort_values()

Manchester by the Sea                               0.500000
Pirates of the Caribbean- Dean men tell no tales    0.625000
Fences                                              0.625000
La La Land                                          0.666667
Beauty and the Beast                                0.700000
Hidden Figures                                      0.700000
dtype: float64

### Conclusion - advantages and disadvantages of using normalized ratings instead of the actual ratings.

After normalizing user reviews, Maddie and Christina switched places in average review score. Normalizing the data did not affect the ranking of the other reviewers scores and it is important to note that the top three as well as the bottom reviewer stayed in the same ranking after normalizing the dataset. The normalized data did make it easier to compare the user reviews. Only two reviewers Carly and Mike were in the bottom half of ranking for the dataset meaning that theier normalized scores wer below 0.5. Based on the normalized data for the reviewers I would conclude that 80% of the people surveyed gave moderate to high reviews of the movies selected.

Also after normalizing movie reviews, Pirates of the Caribbean went from second highest review to second lowest. It is the only movie with two NaN entries so it is possible that if there were more data that the result may not have changed that much.

In [9]:
# Additioal Analysis - standardized data

df_stand = (df - df.mean()) / (df.std())

df_stand

,Beauty and the Beast,Pirates of the Caribbean - Dead men tell no tales,La La Land,Hidden Figures,Fences,Manchester by the Sea
Raters,,,,,,
Carly,0.730297,NaN,-1.771230,-0.447214,-0.912871,-1.195229
Mike,-1.704026,-1.305582,0.885615,0.670820,0.304290,0.597614
Sam,NaN,-0.261116,0.221404,NaN,-1.521452,0.000000
Christina,0.121716,0.783349,-0.442807,-1.565248,0.912871,1.195229
Nigel,0.121716,0.783349,0.221404,0.670820,0.912871,0.597614
Maddie,0.730297,NaN,0.885615,0.670820,0.304290,-1.195229

In [10]:
# Average ratings for each user (using standardized data)

df_stand.T.mean().sort_values()

Raters
Carly       -0.719249
Sam         -0.390291
Mike        -0.091878
Christina    0.167518
Maddie       0.279159
Nigel        0.551296
dtype: float64

In [12]:
# Average ratings for movie (using standardized data)

df_stand.mean().sort_values()

Hidden Figures                                      -4.440892e-16
Manchester by the Sea                                0.000000e+00
Fences                                               9.251859e-18
Pirates of the Caribbean - Dead men tell no tales    5.551115e-17
La La Land                                           1.110223e-16
Beauty and the Beast                                 1.332268e-16
dtype: float64

### Conclusion - standardized data
 The results for the raters for both average ratings and standardized rating same the ranking. This indiated that the rankings of the mean of each rater and the deviation from the mean follow the same trend. The averge of the ratings by movie show a slight variation. Beauty and beast shows the greatest deviation from the mean. The high values with the one as a possible outlier is a possible reason why the values deviated the most from the mean.  Hidden Figures average data values shows that it had the highest average showing that most of its values were centered around the higher end of the reporting range of 1 to 5 giveing int the lowest deviation from the mean and the lower=st standardized value.